benchmarks/results/20260409-075210/baseline-echo-t1-c128.txt
Running 5s test @ http://127.0.0.1:18081/api/echo?src=wrk
  1 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.36ms    2.47ms  19.64ms   85.25%
    Req/Sec    63.24k     8.14k   69.24k    92.00%
  Latency Distribution
     50%    1.08ms
     75%    3.03ms
     90%    5.92ms
     99%   11.13ms
  314456 requests in 5.01s, 68.97MB read
Requests/sec:  62756.35
Transfer/sec:     13.77MB