benchmarks/results/20260409-075210/baseline-echo-t1-c64.txt
Running 5s test @ http://127.0.0.1:18081/api/echo?src=wrk
  1 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.60ms    2.23ms  21.02ms   87.53%
    Req/Sec    63.26k     9.21k   70.07k    90.00%
  Latency Distribution
     50%  491.00us
     75%    1.72ms
     90%    4.59ms
     99%   10.30ms
  314695 requests in 5.00s, 69.03MB read
Requests/sec:  62895.58
Transfer/sec:     13.80MB