benchmarks/results/20260409-075210/baseline-echo-t2-c128.txt
Running 5s test @ http://127.0.0.1:18081/api/echo?src=wrk
  2 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.76ms    2.84ms  20.12ms   84.63%
    Req/Sec    30.63k     3.56k   35.64k    88.00%
  Latency Distribution
     50%    1.07ms
     75%    3.82ms
     90%    7.01ms
     99%   12.70ms
  305308 requests in 5.01s, 66.97MB read
Requests/sec:  60915.69
Transfer/sec:     13.36MB