benchmarks/results/20260409-075210/baseline-echo-t2-c64.txt
Running 5s test @ http://127.0.0.1:18081/api/echo?src=wrk
  2 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.78ms    2.37ms  21.33ms   85.94%
    Req/Sec    31.53k     3.14k   35.52k    88.00%
  Latency Distribution
     50%  520.00us
     75%    2.08ms
     90%    5.25ms
     99%   10.60ms
  313750 requests in 5.01s, 68.82MB read
Requests/sec:  62659.02
Transfer/sec:     13.74MB