benchmarks/results/20260409-075210/baseline-health-t1-c128.txt
Running 5s test @ http://127.0.0.1:18081/api/health
  1 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.15ms    2.54ms  24.54ms   86.90%
    Req/Sec    69.98k     9.52k   75.81k    88.00%
  Latency Distribution
     50%    0.99ms
     75%    2.58ms
     90%    5.51ms
     99%   12.04ms
  348310 requests in 5.01s, 69.76MB read
Requests/sec:  69481.29
Transfer/sec:     13.92MB