benchmarks/results/20260409-075210/baseline-health-t1-c64.txt
Running 5s test @ http://127.0.0.1:18081/api/health
  1 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.52ms    2.15ms  22.06ms   86.76%
    Req/Sec    65.19k    12.19k   77.29k    82.00%
  Latency Distribution
     50%  473.00us
     75%    1.66ms
     90%    4.48ms
     99%    9.90ms
  324419 requests in 5.01s, 64.97MB read
Requests/sec:  64750.36
Transfer/sec:     12.97MB