benchmarks/results/20260409-075210/baseline-health-t2-c128.txt
Running 5s test @ http://127.0.0.1:18081/api/health
  2 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.59ms    3.02ms  26.42ms   85.64%
    Req/Sec    34.34k     4.60k   42.54k    77.00%
  Latency Distribution
     50%    1.11ms
     75%    3.68ms
     90%    6.83ms
     99%   13.40ms
  343215 requests in 5.04s, 68.74MB read
Requests/sec:  68065.80
Transfer/sec:     13.63MB