benchmarks/results/20260409-075210/baseline-health-t2-c64.txt
Running 5s test @ http://127.0.0.1:18081/api/health
  2 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.84ms    2.60ms  26.24ms   86.27%
    Req/Sec    33.83k     4.63k   44.80k    76.00%
  Latency Distribution
     50%  488.00us
     75%    2.55ms
     90%    5.39ms
     99%   11.56ms
  337683 requests in 5.02s, 67.63MB read
Requests/sec:  67213.49
Transfer/sec:     13.46MB