benchmarks/results/20260409-075210/baseline-notfound-t1-c128.txt
Running 5s test @ http://127.0.0.1:18081/missing
  1 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.10ms    2.31ms  29.33ms   85.68%
    Req/Sec    70.48k     9.38k   76.89k    92.00%
  Latency Distribution
     50%    0.98ms
     75%    2.71ms
     90%    5.35ms
     99%   10.37ms
  350283 requests in 5.01s, 70.82MB read
  Non-2xx or 3xx responses: 350283
Requests/sec:  69941.53
Transfer/sec:     14.14MB