benchmarks/results/20260409-075210/baseline-notfound-t1-c64.txt
Running 5s test @ http://127.0.0.1:18081/missing
  1 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.46ms    2.05ms  19.30ms   86.78%
    Req/Sec    69.91k     8.70k   76.54k    90.00%
  Latency Distribution
     50%  444.00us
     75%    1.59ms
     90%    4.28ms
     99%    9.37ms
  347749 requests in 5.00s, 70.31MB read
  Non-2xx or 3xx responses: 347749
Requests/sec:  69505.86
Transfer/sec:     14.05MB