benchmarks/results/20260409-075210/baseline-notfound-t2-c128.txt
Running 5s test @ http://127.0.0.1:18081/missing
  2 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.38ms    2.59ms  24.14ms   86.16%
    Req/Sec    35.38k     2.86k   42.16k    83.00%
  Latency Distribution
     50%    1.24ms
     75%    3.21ms
     90%    5.93ms
     99%   11.73ms
  353626 requests in 5.04s, 71.50MB read
  Non-2xx or 3xx responses: 353626
Requests/sec:  70154.60
Transfer/sec:     14.18MB