benchmarks/results/20260409-075210/baseline-notfound-t2-c64.txt
Running 5s test @ http://127.0.0.1:18081/missing
  2 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.85ms    2.65ms  22.93ms   86.08%
    Req/Sec    35.67k     2.49k   42.98k    71.00%
  Latency Distribution
     50%  428.00us
     75%    2.53ms
     90%    5.57ms
     99%   11.80ms
  355575 requests in 5.03s, 71.89MB read
  Non-2xx or 3xx responses: 355575
Requests/sec:  70665.99
Transfer/sec:     14.29MB