benchmarks/results/20260409-075210/baseline-static-t1-c128.txt
Running 5s test @ http://127.0.0.1:18081/static/index.html
  1 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.84ms    2.63ms  30.00ms   90.00%
    Req/Sec    22.35k     2.21k   24.89k    88.00%
  Latency Distribution
     50%    4.28ms
     75%    7.82ms
     90%    8.24ms
     99%   16.02ms
  111164 requests in 5.01s, 52.37MB read
Requests/sec:  22202.90
Transfer/sec:     10.46MB