benchmarks/results/20260409-075210/baseline-static-t1-c64.txt
Running 5s test @ http://127.0.0.1:18081/static/index.html
  1 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.82ms    1.30ms  24.85ms   91.66%
    Req/Sec    23.07k     2.61k   24.95k    90.00%
  Latency Distribution
     50%    2.00ms
     75%    3.83ms
     90%    3.99ms
     99%    7.18ms
  114782 requests in 5.00s, 54.08MB read
Requests/sec:  22945.40
Transfer/sec:     10.81MB