benchmarks/results/20260409-075210/baseline-static-t2-c128.txt
Running 5s test @ http://127.0.0.1:18081/static/index.html
  2 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.69ms    1.41ms  28.35ms   85.42%
    Req/Sec    11.36k     0.87k   13.73k    84.00%
  Latency Distribution
     50%    5.44ms
     75%    5.64ms
     90%    6.71ms
     99%   11.21ms
  112999 requests in 5.02s, 53.24MB read
Requests/sec:  22505.92
Transfer/sec:     10.60MB