benchmarks/results/20260409-075210/baseline-static-t2-c64.txt
Running 5s test @ http://127.0.0.1:18081/static/index.html
  2 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.84ms    1.22ms  25.16ms   93.59%
    Req/Sec    11.55k   809.92    12.64k    85.00%
  Latency Distribution
     50%    2.61ms
     75%    2.92ms
     90%    3.91ms
     99%    7.62ms
  115015 requests in 5.01s, 54.19MB read
Requests/sec:  22957.37
Transfer/sec:     10.82MB