benchmarks/results/20260409-075210/idle_timeout_1s-health-t1-c128.txt
Running 5s test @ http://127.0.0.1:18081/api/health
  1 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.15ms    2.49ms  24.46ms   86.38%
    Req/Sec    73.35k     3.96k   77.05k    90.00%
  Latency Distribution
     50%    0.96ms
     75%    2.57ms
     90%    5.55ms
     99%   11.67ms
  365180 requests in 5.01s, 73.14MB read
Requests/sec:  72903.11
Transfer/sec:     14.60MB