benchmarks/results/20260409-075210/idle_timeout_1s-health-t1-c64.txt
Running 5s test @ http://127.0.0.1:18081/api/health
  1 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.55ms    2.18ms  21.65ms   86.19%
    Req/Sec    72.74k     5.35k   77.34k    86.00%
  Latency Distribution
     50%  440.00us
     75%    1.79ms
     90%    4.64ms
     99%    9.68ms
  361902 requests in 5.00s, 72.48MB read
Requests/sec:  72319.02
Transfer/sec:     14.48MB