benchmarks/results/20260409-075210/idle_timeout_1s-health-t2-c128.txt
Running 5s test @ http://127.0.0.1:18081/api/health
  2 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.54ms    3.02ms  23.16ms   85.34%
    Req/Sec    36.59k     2.04k   41.20k    74.00%
  Latency Distribution
     50%    0.90ms
     75%    3.68ms
     90%    6.85ms
     99%   13.17ms
  365894 requests in 5.04s, 73.28MB read
Requests/sec:  72602.57
Transfer/sec:     14.54MB