benchmarks/results/20260409-075210/idle_timeout_1s-health-t2-c64.txt
Running 5s test @ http://127.0.0.1:18081/api/health
  2 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.82ms    2.59ms  24.07ms   86.17%
    Req/Sec    35.37k     3.16k   40.53k    71.00%
  Latency Distribution
     50%  450.00us
     75%    2.53ms
     90%    5.38ms
     99%   11.54ms
  353934 requests in 5.04s, 70.88MB read
Requests/sec:  70228.90
Transfer/sec:     14.06MB