benchmarks/results/20260409-075210/keepalive_off-health-t1-c128.txt
Running 5s test @ http://127.0.0.1:18081/api/health
  1 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.99ms    3.46ms  27.17ms   71.27%
    Req/Sec     9.31k     1.49k   12.41k    66.00%
  Latency Distribution
     50%    3.95ms
     75%    7.18ms
     90%    9.93ms
     99%   16.14ms
  47117 requests in 5.09s, 9.21MB read
Requests/sec:   9255.13
Transfer/sec:      1.81MB