benchmarks/results/20260409-075210/keepalive_off-health-t1-c64.txt
Running 5s test @ http://127.0.0.1:18081/api/health
  1 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.77ms    2.13ms  21.59ms   77.42%
    Req/Sec     9.72k     1.67k   13.00k    60.00%
  Latency Distribution
     50%    2.29ms
     75%    3.83ms
     90%    5.29ms
     99%   10.35ms
  48683 requests in 5.04s, 9.52MB read
Requests/sec:   9660.42
Transfer/sec:      1.89MB