benchmarks/results/20260409-075210/keepalive_off-health-t2-c128.txt
Running 5s test @ http://127.0.0.1:18081/api/health
  2 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.82ms    4.15ms  32.04ms   71.64%
    Req/Sec     5.01k     0.89k    7.08k    59.18%
  Latency Distribution
     50%    5.06ms
     75%    8.05ms
     90%   11.36ms
     99%   18.93ms
  50190 requests in 5.05s, 9.81MB read
Requests/sec:   9943.95
Transfer/sec:      1.94MB