benchmarks/results/20260409-075210/keepalive_off-health-t2-c64.txt
Running 5s test @ http://127.0.0.1:18081/api/health
  2 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.22ms    2.46ms  27.05ms   73.65%
    Req/Sec     5.04k     0.97k    7.94k    62.63%
  Latency Distribution
     50%    2.75ms
     75%    4.44ms
     90%    6.38ms
     99%   10.83ms
  50345 requests in 5.07s, 9.84MB read
Requests/sec:   9938.75
Transfer/sec:      1.94MB